OdDbBaseGeoDataExportPE.getGeoExtents(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdArray&lt;OdGePoint2d,OdMemoryAllocator&lt;OdGePoint2d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdGePoint2d,OdMemoryAllocator&lt;OdGePoint2d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the boundaries where the geographic system is valid. If clipPoints is empty, the coordinates of whole map extents will be returned
\param pDb        [in]     Pointer to a database object.
\param geoExtents [out]    array of points in geo coordinates (latitude-longitude).
\param clipPoints [in/out] array of points in drawing coordinates (x-y), corresponding with geo coordinates above
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbBaseGeoDataExportPE.getGeoDataParams(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets WKT representation of the current coordinate system definition, coordinate system type and EPSG code.
\param pDb      [in]  Pointer to a database object.
\param sWktDef  [out] WKT representation of coordinate system.
\param type     [out] Coordinate system type. 0 - Geographic, 1 - Projected
\param epsgCode [out] EPSG code of coordinate system
\returns Returns eOk if successful or an appropriate error code otherwise.